In [2]:
import pandas as pd
import numpy as np
import re
import sys 
sys.path.append("../")
import src.df_functions as sp


<center> <h1>CSV Clean </h1></center>

## - ENDANGERMENT LANGUAGES

In [3]:
# cargamos el csv 
df= pd.read_csv("../data/Kaggle/data.csv")
df.head(2)

,ID,Name in English,Name in French,Name in Spanish,Countries,Country codes alpha 3,ISO639-3 codes,Degree of endangerment,Alternate names,Name in the language,Number of speakers,Sources,Latitude,Longitude,Description of the location
0,1022,South Italian,italien du sud,napolitano-calabrés,Italy,ITA,nap,Vulnerable,Neapolitan; Neapolitan-Calabrese; неаполитанск...,NaN,7500000.0,NaN,40.9798,15.2490,"Campania, Lucania (Basilicata), Abruzzi (Abruz..."
1,1023,Sicilian,sicilien,siciliano,Italy,ITA,scn,Vulnerable,NaN,NaN,5000000.0,NaN,37.4399,14.5019,"Sicily (Sicilia), southern and central Calabri..."

In [6]:
# drop columns  
df=df.drop(labels=['ID','Name in French', 'Name in Spanish','Country codes alpha 3','ISO639-3 codes','Alternate names','Name in the language','Sources','Description of the location'], axis=1)

In [7]:
df.head(2)

,Name in English,Countries,Degree of endangerment,Number of speakers,Latitude,Longitude
0,South Italian,Italy,Vulnerable,7500000.0,40.9798,15.2490
1,Sicilian,Italy,Vulnerable,5000000.0,37.4399,14.5019

In [9]:
df.columns = df.columns.str.lower()
df.head(1)

,name in english,countries,degree of endangerment,number of speakers,latitude,longitude
0,South Italian,Italy,Vulnerable,7500000.0,40.9798,15.249

In [10]:
df= df.rename(columns={'name in english':'language',
                                   'ountries':'countries',
                               'degree of endangerment':'endangerment',
                               'number of speakers': 'speakers'})
df.head(1)

        language countries endangerment   speakers  latitude  longitude
0  South Italian     Italy   Vulnerable  7500000.0   40.9798     15.249

In [11]:
sp.exploration_df(df)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2722 entries, 0 to 2721
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   language      2722 non-null   object
 1   countries     2721 non-null   object
 2   endangerment  2722 non-null   object
 3   speakers      2539 non-null   float64
 4   latitude      2719 non-null   float64
 5   longitude     2719 non-null   float64
dtypes: float64(3), object(3)
memory usage: 127.7+ KB

In [13]:
df.duplicated().sum()

0

In [16]:
#visualizamos los nulos
df.isnull().sum()

language          0
countries         1
endangerment      0
speakers        183
latitude          3
longitude         3
dtype: int64

In [ ]:
df_new['endangerment'].value_counts()

In [17]:
df[df['speakers'].isnull()]

,language,countries,endangerment,speakers,latitude,longitude
2539,A'tong,India,Severely endangered,NaN,25.2844,91.1755
2540,Aché,Paraguay,Definitely endangered,NaN,-25.6613,-55.6787
2541,Akie,United Republic of Tanzania,Critically endangered,NaN,-4.7735,37.3315
2542,Akuriyo,Suriname,Critically endangered,NaN,2.8442,-55.7556
2543,Alemannic,"Germany, Austria, France, Italy, Liechtenstein...",Vulnerable,NaN,47.2792,7.6904
...,...,...,...,...,...,...
2717,Yonaguni,Japan,Severely endangered,NaN,24.4580,122.9802
2718,Yucuna,Colombia,Definitely endangered,NaN,-1.2633,-70.6640
2719,Yurutí (Colombia),Colombia,Definitely endangered,NaN,1.1370,-70.2136
2720,Zangskari,"India, Pakistan",Definitely endangered,NaN,34.0833,76.8500
2721,Zidgali,Oman,Critically endangered,NaN,23.4027,58.0957

In [20]:
df['speakers'] = df['speakers'].fillna(0)

In [21]:
df[df['countries'].isnull()]

    language countries           endangerment  speakers  latitude  longitude
405     Boro       NaN  Definitely endangered   19878.0   10.3581    35.0024

In [22]:
df= df.dropna()

In [23]:
df.isnull().sum()

language        0
countries       0
endangerment    0
speakers        0
latitude        0
longitude       0
dtype: int64

In [25]:
sp.exploration_df(df)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2718 entries, 0 to 2721
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   language      2718 non-null   object
 1   countries     2718 non-null   object
 2   endangerment  2718 non-null   object
 3   speakers      2718 non-null   float64
 4   latitude      2718 non-null   float64
 5   longitude     2718 non-null   float64
dtypes: float64(3), object(3)
memory usage: 148.6+ KB

In [26]:
df['speakers'] = df['speakers'].astype('int64')

In [27]:
sp.exploration_df(df)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2718 entries, 0 to 2721
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   language      2718 non-null   object
 1   countries     2718 non-null   object
 2   endangerment  2718 non-null   object
 3   speakers      2718 non-null   int64
 4   latitude      2718 non-null   float64
 5   longitude     2718 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 148.6+ KB

In [29]:
#df.to_csv('../clean_data/df_languages.csv', sep=',', index=True)

In [32]:
df['endangerment'].unique()

array(['Vulnerable', 'Definitely endangered', 'Severely endangered',
       'Critically endangered', 'Extinct'], dtype=object)

In [33]:
df['endangerment'].value_counts()

Definitely endangered    679
Vulnerable               627
Critically endangered    606
Severely endangered      554
Extinct                  252
Name: endangerment, dtype: int64

In [35]:
# Paises en los cuales hay mayor presencia de lenguas en peligro 
counts= df["countries"].value_counts()

In [36]:
counts_sort = counts.sort_values(ascending=False)

counts_sort.head(10)

United States of America    216
Brazil                      186
India                       163
Indonesia                   149
Mexico                      143
China                       122
Russian Federation          119
Australia                   108
Papua New Guinea             98
Canada                       82
Name: countries, dtype: int64

In [ ]:
df_peru= df_new[df_new['countries'].str.contains('Peru')]

In [ ]:
fig = px.pie(df_peru, values='speakers', names='endangerment', title='endangerment_peru')
fig.show()

In [ ]:
df_new["language"]

## - USA ENDANGERMENT LANGUAGES

In [39]:
df["countries"].str.contains('United States of America').sum()

227

In [40]:
df_usa=df[df['countries'].str.contains('United States of America')]
df_usa.head(3)

,language,countries,endangerment,speakers,latitude,longitude
156,Navajo,United States of America,Vulnerable,120000,35.8044,-108.4750
359,Sioux,United States of America,Vulnerable,25000,43.0588,-102.5244
443,O'odham (Akimel),United States of America,Definitely endangered,15000,33.0590,-112.0479

In [42]:
df_usa["countries"].unique()

array(['United States of America', 'Canada, United States of America'],
      dtype=object)

In [43]:
#borramos las filas que contengan Canada 
remove= df_usa['countries'].str.contains("Canada, United States of America")
df_usa= df_usa[~remove]
df_usa.shape

(216, 6)

In [44]:
df_usa=df_usa.drop(labels=['countries'], axis=1)

In [45]:
df_usa.head(2)

    language endangerment  speakers  latitude  longitude
156   Navajo   Vulnerable    120000   35.8044  -108.4750
359    Sioux   Vulnerable     25000   43.0588  -102.5244

In [46]:
sp.exploration_df(df_usa)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 216 entries, 156 to 2712
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   language      216 non-null    object
 1   endangerment  216 non-null    object
 2   speakers      216 non-null    int64
 3   latitude      216 non-null    float64
 4   longitude     216 non-null    float64
dtypes: float64(2), int64(1), object(2)
memory usage: 10.1+ KB

In [47]:
#df_usa.to_csv('../clean_data/df_usa_languages.csv', sep=',', index=True)

<center> <h1>Web Scraping Clean </h1></center>

## - Historical populaton by state

In [49]:
df_pop= pd.read_csv("../data/web_scraping/df_population_usa.csv", index_col=0)
df_pop.head(5)

,state,1960,1970,1980,1990,2000,2010,2020
0,Alabama\n,"3,266,740\n","3,444,165\n","3,893,888\n","4,040,587\n","4,447,100\n","4,779,736\n","5,024,279\n"
1,Alaska\n,"226,167\n","300,382\n","401,851\n","550,043\n","626,932\n","710,231\n","733,391\n"
2,American Samoa\n,"20,051\n","27,159\n","32,297\n","46,773\n","57,291\n","55,519\n","49,710\n"
3,Arizona\n,"1,302,161\n","1,770,900\n","2,718,215\n","3,665,228\n","5,130,632\n","6,392,017\n","7,151,502\n"
4,Arkansas\n,"1,786,272\n","1,923,295\n","2,286,435\n","2,350,725\n","2,673,400\n","2,915,918\n","3,011,524\n"

In [50]:
df_pop=df_pop.replace('\n','', regex=True)
df_pop.head(1)

,state,1960,1970,1980,1990,2000,2010,2020
0,Alabama,"3,266,740","3,444,165","3,893,888","4,040,587","4,447,100","4,779,736","5,024,279"

In [55]:
df_1=df_1.drop(df_1.index[-1])

In [51]:
df_1=df_pop.copy()

In [54]:
columns_to_convert= df_1.columns[1:9]

In [56]:
for col in columns_to_convert:
    df_1[col] = df_1[col].replace( '[^0-9]', '', regex=True )

In [57]:
# Iterate through the list of column names
for col in columns_to_convert:
    df_1[col] = df_1[col].apply(lambda x: int(x))

In [58]:
df_1.head(1)

      state     1960     1970     1980     1990     2000     2010     2020
0   Alabama  3266740  3444165  3893888  4040587  4447100  4779736  5024279

In [62]:
df_1.columns[1]

'1960'

In [64]:
df_1=df_1.drop(df_1.columns[1],axis=1)

In [65]:
sp.exploration_df(df_1)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 56 entries, 0 to 55
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   56 non-null     object
 1   1970    56 non-null     int64
 2   1980    56 non-null     int64
 3   1990    56 non-null     int64
 4   2000    56 non-null     int64
 5   2010    56 non-null     int64
 6   2020    56 non-null     int64
dtypes: int64(6), object(1)
memory usage: 5.6+ KB

In [66]:
df_1.head(1)

      state     1970     1980     1990     2000     2010     2020
0   Alabama  3444165  3893888  4040587  4447100  4779736  5024279

In [67]:
#df_1.to_csv('../clean_data/df_usa_pop.csv', sep=',', index=True)

## - Historial ethnic population

In [70]:
df_eth= pd.read_csv("../data/web_scraping/df_ethpop_usa.csv", index_col=0)
df_eth.head(5)

,state,1890,1900,1910,1920,1930,1940,1950,1960,1970,1980,1990,2000,2010,2020
0,United States\n,0.4%\n,0.4%\n,0.4%\n,0.4%\n,0.4%\n,0.4%\n,0.4%\n,0.4%\n,0.3%\n,0.3%\n,0.2%\n,0.3%\n,0.3%\n,0.2%\n
1,Alabama\n,0.1%\n,0.1%\n,0.1%\n,0.1%\n,0.1%\n,0.1%\n,0.1%\n,0.1%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n
2,Alaska\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n
3,Arizona\n,34.0%\n,34.0%\n,34.0%\n,34.0%\n,34.0%\n,34.0%\n,34.0%\n,34.0%\n,21.5%\n,14.3%\n,9.9%\n,10.0%\n,11.0%\n,8.8%\n
4,Arkansas\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n,0.0%\n

In [71]:
df_eth= df_eth.drop(df_eth.columns[1:9], axis=1)

In [72]:
df_eth.head(1)

             state    1970    1980    1990    2000    2010    2020
0  United States\n  0.3%\n  0.3%\n  0.2%\n  0.3%\n  0.3%\n  0.2%\n

In [73]:
df_eth=df_eth.replace('\n','', regex=True)
df_eth.head(1)

           state  1970  1980  1990  2000  2010  2020
0  United States  0.3%  0.3%  0.2%  0.3%  0.3%  0.2%

In [75]:
sp.exploration_df(df_eth)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   52 non-null     object
 1   1970    52 non-null     object
 2   1980    52 non-null     object
 3   1990    52 non-null     object
 4   2000    52 non-null     object
 5   2010    52 non-null     object
 6   2020    52 non-null     object
dtypes: object(7)
memory usage: 3.2+ KB

In [74]:
df_eth=df_eth.drop(df_eth.index[-1])

In [76]:
df_copy=df_eth.copy()

In [77]:
df_copy.loc[2]=["Alaska","0","16.0","15.6","15.6","14.8","15.2"]
df_copy.loc[12]=["Hawaii","0.1","0.1","0.3","0.5","0.3","0.3"]

In [78]:
df_copy.head(2)

           state  1970  1980  1990  2000  2010  2020
0  United States  0.3%  0.3%  0.2%  0.3%  0.3%  0.2%
1        Alabama  0.0%  0.0%  0.0%  0.0%  0.0%  0.0%

In [79]:
df_copy = df_copy.replace(np.nan, 0)

In [80]:
df_copy.isnull().sum()

state    0
1970     0
1980     0
1990     0
2000     0
2010     0
2020     0
dtype: int64

In [81]:
df_copy = df_copy.replace("", 0)

In [83]:
columns_to_convert_2= df_copy.columns[1:9]

In [84]:
for col in columns_to_convert_2:
    df_copy[col] = df_copy[col].replace( '%', '', regex=True )

In [85]:
for col in columns_to_convert_2:
    df_copy[col] = df_copy[col].apply(lambda x: float(x))

In [87]:
sp.exploration_df(df_copy)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 0 to 51
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   state   52 non-null     object
 1   1970    52 non-null     float64
 2   1980    52 non-null     float64
 3   1990    52 non-null     float64
 4   2000    52 non-null     float64
 5   2010    52 non-null     float64
 6   2020    52 non-null     float64
dtypes: float64(6), object(1)
memory usage: 5.3+ KB

In [88]:
#df_copy.to_csv('../clean_data/df_ethpop_usa.csv', sep=',', index=True)